Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# weekly.sort.starsAsc
source: Stars Ascending
ar: النجوم تصاعديًا
de: Sterne aufsteigend
es: Estrellas ascendentes
fr: Étoiles croissantes
id: Bintang Menaik
it: Stelle crescenti
ja: スターの昇順
ko: 별표 오름차순
nl: Sterren oplopend
pl: Gwiazdki rosnąco
pt_br: Estrelas (crescente)
ru: Звёзды по возрастанию
tr: Yıldız Artan
uk: Зірки за зростанням
vi: Sao tăng dần
zh_hans: Stars 升序
zh_hant: Stars 升序

# weekly.sort.starsDesc
source: Stars Descending
ar: النجوم تنازليًا
de: Sterne absteigend
es: Estrellas descendentes
fr: Étoiles décroissantes
id: Bintang Menurun
it: Stelle decrescenti
ja: スターの降順
ko: 별표 내림차순
nl: Sterren aflopend
pl: Gwiazdki malejąco
pt_br: Estrelas (decrescente)
ru: Звёзды по убыванию
tr: Yıldız Azalan
uk: Зірки за спаданням
vi: Sao giảm dần
zh_hans: Stars 降序
zh_hant: Stars 降序

# weekly.sort.updatedAsc
source: Oldest Updated
ar: الأقدم تحديثًا
de: Älteste Aktualisierung
es: Más antiguos actualizados
fr: Plus anciens mis à jour
id: Paling Lama Diperbarui
it: Più vecchi aggiornati
ja: 最も古い更新
ko: 가장 오래된 업데이트
nl: Oudst bijgewerkt
pl: Najstarsze aktualizowane
pt_br: Atualização mais antiga
ru: Сначала старые обновления
tr: En Eski Güncellenen
uk: Найстаріші оновлені
vi: Cũ nhất theo ngày cập nhật
zh_hans: 最早更新
zh_hant: 最早更新

# weekly.sort.updatedDesc
source: Recently Updated
ar: محدث مؤخرًا
de: Kürzlich aktualisiert
es: Actualizados recientemente
fr: Plus récents mis à jour
id: Baru Saja Diperbarui
it: Aggiornati di recente
ja: 最近更新された
ko: 최근 업데이트
nl: Recent bijgewerkt
pl: Ostatnio aktualizowane
pt_br: Atualização mais recente
ru: Недавно обновлённые
tr: En Son Güncellenen
uk: Нещодавно оновлені
vi: Mới nhất theo ngày cập nhật
zh_hans: 最近更新
zh_hant: 最近更新

# weekly.source.aiIntelligence
source: AI Intelligence
ar: ذكاء اصطناعي
de: KI-Intelligenz
es: Inteligencia artificial
fr: Intelligence artificielle
id: Kecerdasan AI
it: Intelligenza Artificiale
ja: AIインテリジェンス
ko: AI 인텔리전스
tr: AI Zekası
zh_hans: AI 情报
zh_hant: AI 情報

# weekly.source.ruanyf
source: Weekly
ar: أسبوعي
de: Wöchentlich
id: Mingguan
ko: 위클리
tr: Haftalık
zh_hans: 周刊
zh_hant: 週刊

# weekly.sourceEvents.title
source: Source history
ar: سجل المصادر
de: Quellenverlauf
es: Historial de fuentes
fr: Historique des sources
id: Riwayat sumber
it: Cronologia fonti
ja: ソース履歴
ko: 소스 기록
nl: Bronhistorie
pl: Historia źródeł
pt_br: Histórico da fonte
ru: История источников
tr: Kaynak geçmişi
uk: Історія джерел
vi: Lịch sử nguồn
zh_hans: 来源记录
zh_hant: 來源記錄

# weekly.totalCountFormat
source: %d projects
ar: %d مشاريع
de: %d Projekte
es: %d proyectos
fr: %d projets
id: %d proyek
it: %d progetti
ja: %d プロジェクト
ko: %d개 프로젝트
nl: %d projecten
pl: %d projektów
pt_br: %d projetos
ru: %d проектов
tr: %d proje
uk: %d проєктів
vi: %d dự án
zh_hans: 共 %d 项
zh_hant: 共 %d 項

# wiki.menu.help
source: Open external repository documentation
ar: فتح توثيق المستودع الخارجي
de: Externe Repository-Dokumentation öffnen
es: Abrir documentación del repositorio externo
fr: Ouvrir la documentation du dépôt externe
id: Buka dokumentasi repositori eksternal
it: Apri documentazione esterna del repository
ja: 外部リポジトリのドキュメントを開く
ko: 외부 저장소 문서 열기
nl: Open externe repository-documentatie
pl: Otwórz zewnętrzną dokumentację repozytorium
pt_br: Abrir documentação externa do repositório
ru: Открыть внешнюю документацию репозитория
tr: Harici depo belgelerini aç
uk: Відкрити зовнішню документацію репозиторію
vi: Mở tài liệu kho lưu trữ bên ngoài
zh_hans: 打开仓库的外部文档
zh_hant: 開啟倉庫的外部文件

# wiki.menu.title
source: Wiki
ar: ويكي
ko: 위키
uk: Вікі

# workspace.chatModelRequired.message
source: The RAG workspace requires at least one verified and enabled model assigned to the Chat task. You can use it after completing the configuration.
ar: تتطلب مساحة عمل RAG نموذجًا واحدًا على الأقل تم التحقق منه وتمكينه ومخصص لمهمة الدردشة. يمكنك استخدامها بعد إكمال التكوين.
de: Der RAG-Arbeitsbereich erfordert mindestens ein verifiziertes und aktiviertes Modell, das der Chat-Aufgabe zugewiesen ist. Sie können ihn nach Abschluss der Konfiguration verwenden.
es: El espacio de trabajo RAG requiere al menos un modelo verificado y habilitado asignado a la tarea de Chat. Puedes usarlo después de completar la configuración.
fr: L'espace de travail RAG nécessite au moins un modèle vérifié et activé pour la tâche de chat. Vous pouvez l'utiliser après avoir terminé la configuration.
id: Ruang kerja RAG memerlukan setidaknya satu model yang terverifikasi dan diaktifkan yang ditugaskan ke tugas Chat. Anda dapat menggunakannya setelah menyelesaikan konfigurasi.
it: L'area di lavoro RAG richiede almeno un modello verificato e abilitato assegnato all'attività Chat. Puoi usarla dopo aver completato la configurazione.
ja: RAGワークスペースでは、Chatタスクに割り当てられた検証済みで有効なモデルが少なくとも1つ必要です。設定を完了すると使用できます。
ko: RAG 워크스페이스는 채팅 작업에 할당된 검증되고 활성화된 모델이 하나 이상 필요합니다. 설정을 완료한 후 사용할 수 있습니다.
nl: De RAG-werkruimte vereist ten minste één geverifieerd en ingeschakeld model dat is toegewezen aan de Chat-taak. U kunt deze gebruiken na het voltooien van de configuratie.
pl: Obszar roboczy RAG wymaga co najmniej jednego zweryfikowanego i włączonego modelu przypisanego do zadania czatu. Możesz go użyć po zakończeniu konfiguracji.
pt_br: O espaço de trabalho RAG requer pelo menos um modelo verificado e habilitado atribuído à tarefa de Chat. Você pode usá-lo após concluir a configuração.
ru: Для RAG-рабочего пространства требуется хотя бы одна проверенная и включённая модель, назначенная задаче Chat. Вы сможете использовать его после завершения настройки.
tr: RAG çalışma alanı, Sohbet görevine atanmış en az bir doğrulanmış ve etkin model gerektirir. Yapılandırmayı tamamladıktan sonra kullanabilirsiniz.
uk: Робоче середовище RAG потребує принаймні однієї перевіреної та ввімкненої моделі, призначеної для завдання чату. Ви можете використовувати його після завершення налаштування.
vi: Không gian làm việc RAG yêu cầu ít nhất một mô hình đã được xác minh và bật được gán cho tác vụ Chat. Bạn có thể sử dụng sau khi hoàn tất cấu hình.
zh_hans: RAG 工作台需要至少一个已验证、已启用，并分配给“对话”任务的模型。完成配置后即可使用。
zh_hant: RAG 工作台需要至少一個已驗證、已啟用並分配給「對話」任務的模型。完成設定後即可使用。

# workspace.chatModelRequired.openSettings
source: Open Model Settings
ar: فتح إعدادات النموذج
de: Modelleinstellungen öffnen
es: Abrir configuración de modelos
fr: Ouvrir les paramètres du modèle
id: Buka Pengaturan Model
it: Apri impostazioni modello
ja: モデル設定を開く
ko: 모델 설정 열기
nl: Modelinstellingen openen
pl: Otwórz ustawienia modelu
pt_br: Abrir configurações do modelo
ru: Открыть настройки моделей
tr: Model Ayarlarını Aç
uk: Відкрити налаштування моделей
vi: Mở Cài đặt Mô hình
zh_hans: 打开模型设置
zh_hant: 開啟模型設定

# workspace.chatModelRequired.title
source: Chat Model Required
ar: نموذج الدردشة مطلوب
de: Chat-Modell erforderlich
es: Modelo de chat requerido
fr: Modèle de chat requis
id: Model Chat Diperlukan
it: Modello Chat richiesto
ja: Chatモデルが必要
ko: 채팅 모델 필요
nl: Chatmodel vereist
pl: Wymagany model czatu
pt_br: Modelo de chat necessário
ru: Требуется модель чата
tr: Sohbet Modeli Gerekli
uk: Потрібна модель чату
vi: Yêu cầu Mô hình Chat
zh_hans: 需要配置对话模型
zh_hant: 需要設定對話模型

# workspace.chrome.hideLeft
source: Hide Left Sidebar
ar: إخفاء الشريط الجانبي الأيسر
de: Linke Seitenleiste ausblenden
es: Ocultar barra lateral izquierda
fr: Masquer la barre latérale gauche
id: Sembunyikan Bilah Sisi Kiri
it: Nascondi barra laterale sinistra
ja: 左サイドバーを隠す
ko: 왼쪽 사이드바 숨기기
nl: Linkerzijbalk verbergen
pl: Ukryj lewy panel boczny
pt_br: Ocultar barra lateral esquerda
ru: Скрыть левую боковую панель
tr: Sol Kenar Çubuğunu Gizle
uk: Сховати ліву бічну панель
vi: Ẩn Thanh bên Trái
zh_hans: 隐藏左栏
zh_hant: 隱藏左側欄

# workspace.chrome.hideRight
source: Hide Right Sidebar
ar: إخفاء الشريط الجانبي الأيمن
de: Rechte Seitenleiste ausblenden
es: Ocultar barra lateral derecha
fr: Masquer la barre latérale droite
id: Sembunyikan Bilah Sisi Kanan
it: Nascondi barra laterale destra
ja: 右サイドバーを隠す
ko: 오른쪽 사이드바 숨기기
nl: Rechterzijbalk verbergen
pl: Ukryj prawy panel boczny
pt_br: Ocultar barra lateral direita
ru: Скрыть правую боковую панель
tr: Sağ Kenar Çubuğunu Gizle
uk: Сховати праву бічну панель
vi: Ẩn Thanh bên Phải
zh_hans: 隐藏右栏
zh_hant: 隱藏右側欄

# workspace.chrome.pin
source: Keep Window on Top
ar: إبقاء النافذة في المقدمة
de: Fenster immer im Vordergrund
es: Mantener ventana al frente
fr: Garder la fenêtre au premier plan
id: Jaga Jendela di Atas
it: Mantieni finestra in primo piano
ja: ウィンドウを常に前面に表示
ko: 창을 항상 위에 유지
nl: Venster bovenop houden
pl: Utrzymuj okno na wierzchu
pt_br: Manter janela no topo
ru: Держать окно поверх всех
tr: Pencereyi Üstte Tut
uk: Тримати вікно поверх інших
vi: Luôn ở trên cùng
zh_hans: 置顶窗口
zh_hant: 保持視窗在最上層

# workspace.chrome.showLeft
source: Show Left Sidebar
ar: إظهار الشريط الجانبي الأيسر
de: Linke Seitenleiste einblenden
es: Mostrar barra lateral izquierda
fr: Afficher la barre latérale gauche
id: Tampilkan Bilah Sisi Kiri
it: Mostra barra laterale sinistra
ja: 左サイドバーを表示
ko: 왼쪽 사이드바 보이기
nl: Linkerzijbalk tonen
pl: Pokaż lewy panel boczny
pt_br: Mostrar barra lateral esquerda
ru: Показать левую боковую панель
tr: Sol Kenar Çubuğunu Göster
uk: Показати ліву бічну панель
vi: Hiện Thanh bên Trái
zh_hans: 显示左栏
zh_hant: 顯示左側欄

# workspace.chrome.showRight
source: Show Right Sidebar
ar: إظهار الشريط الجانبي الأيمن
de: Rechte Seitenleiste einblenden
es: Mostrar barra lateral derecha
fr: Afficher la barre latérale droite
id: Tampilkan Bilah Sisi Kanan
it: Mostra barra laterale destra
ja: 右サイドバーを表示
ko: 오른쪽 사이드바 보이기
nl: Rechterzijbalk tonen
pl: Pokaż prawy panel boczny
pt_br: Mostrar barra lateral direita
ru: Показать правую боковую панель
tr: Sağ Kenar Çubuğunu Göster
uk: Показати праву бічну панель
vi: Hiện Thanh bên Phải
zh_hans: 显示右栏
zh_hant: 顯示右側欄

# workspace.chrome.unpin
source: Unpin Window
ar: إلغاء تثبيت النافذة
de: Fenster nicht mehr im Vordergrund
es: Desfijar ventana
fr: Détacher la fenêtre
id: Lepas Sematan Jendela
it: Rimuovi finestra dal primo piano
ja: ピン留めを解除
ko: 창 고정 해제
nl: Venster losmaken
pl: Odepnij okno
pt_br: Desafixar janela
ru: Открепить окно
tr: Pencereyi Sabitlemeyi Kaldır
uk: Відкріпити вікно
vi: Bỏ ghim cửa sổ
zh_hans: 取消窗口置顶
zh_hant: 取消視窗置頂

# agent.approval.status.approved
source: Approved
ar: مُصَدَّق
de: Genehmigt
es: Aprobado
fr: Approuvé
id: Disetujui
it: Approvato
ja: 承認済み
ko: 승인됨
nl: Goedgekeurd
pl: Zaakceptowano
pt_br: Aprovado
ru: Утверждено
tr: Onaylandı
uk: Затверджено
vi: Đã chấp nhận
zh_hans: 已批准
zh_hant: 已批准

# agent.approval.status.cancelled
source: Cancelled
ar: مُلغى
de: Storniert
es: Cancelado
fr: Annulé
id: Dibatalkan
it: Annullato
ja: キャンセル済み
ko: 취소됨
nl: Geannuleerd
pl: Anulowano
pt_br: Cancelado
ru: Отменено
tr: İptal edildi
uk: Скасовано
vi: Hủy bỏ
zh_hans: 已取消
zh_hant: 已取消

# agent.approval.status.executed
source: Executed
ar: تم التنفيذ
de: Ausgeführt
es: Ejecutado
fr: Exécuté
id: Telah Dieksekusi
it: Eseguito
ja: 実行済み
ko: 실행됨
nl: Uitgevoerd
pl: Wykonano
pt_br: Executado
ru: Выполнено
tr: Yürütüldü
uk: Виконано
vi: Đang thực thi
zh_hans: 已执行
zh_hant: 已執行

# agent.approval.status.executing
source: Executing
ar: جاري التنفيذ
de: Wird ausgeführt
es: Ejecución en curso
fr: En cours d'exécution
id: Sedang Dieksekusi
it: In esecuzione
ja: 実行中
ko: 실행 중
nl: In uitvoering
pl: W trakcie wykonania
pt_br: Em execução
ru: В процессе выполнения
tr: Yürütülmekte
uk: Виконання
vi: Thực thi
zh_hans: 执行中
zh_hant: 正在執行中

# agent.approval.status.failed
source: Failed
ar: فشل
de: Fehlgeschlagen
es: Fallido
fr: Échec
id: Gagal
it: Fallito
ja: 失敗
ko: 실패
nl: Gefaald
pl: Nieudane
pt_br: Falhou
ru: Неудачно
tr: Başarısız oldu
uk: Помилка
vi: Thất bại
zh_hans: 执行失败
zh_hant: 失敗

# agent.approval.status.rejected
source: Rejected
ar: مرفوض
de: Abgelehnt
es: Rechazado
fr: Rejeté
id: Ditolak
it: Rifiutato
ja: 拒否
ko: 거부됨
nl: Afgewezen
pl: Odrzucono
pt_br: Rejeitado
ru: Отклонено
tr: Reddedildi
uk: Відхилено
vi: Từ chối
zh_hans: 已拒绝
zh_hant: 被拒絕

# agent.capability.analysis
source: analysis
ar: تحليل
de: Analyse
es: análisis
fr: analyse
id: analisis
it: analisi
ja: 解析
ko: 분석
nl: analyse
pl: analiza
pt_br: análise
ru: анализ
tr: analiz
uk: аналіз
vi: phân tích
zh_hans: 分析
zh_hant: 分析

# agent.capability.artifact
source: artifact
ar: مادة
es: artefacto
fr: artéfact
id: artefak
it: articolo/oggetto
ja: アーティファクト
ko: 아티팩트
nl: artefact
pl: artykul (plik)
pt_br: artefato
ru: артефакт
tr: sanat eserleri
uk: артефакт
vi: tài liệu kỹ thuật
zh_hans: 产出物
zh_hant: 工件

# agent.capability.citation
source: citation
ar: استشهاد
de: Zitat
es: citación
id: situs
it: citazione
ja: 引用
ko: 참고문헌
nl: citatie
pl: cytat
pt_br: citação
ru: цитирование
tr: alıntı
uk: цитування
vi: trích dẫn
zh_hans: 引用
zh_hant: 引文

# agent.capability.cleanup
source: cleanup
ar: تنظيف
de: Aufräumen
es: limpieza
fr: nettoyage
id: pembersihan
it: pulizia
ja: クリーンアップ
ko: 정리
nl: opruiming
pl: czyszczenie
pt_br: limpeza
ru: очистка
tr: temizlik
uk: очищення
vi: sạch sẽ
zh_hans: 清理
zh_hant: 清理

# agent.capability.cluster
source: cluster
ar: عقد
es: clúster
id: kelompok
ja: クラスタリング
ko: 클러스터
pl: klaster
ru: кластеризация
tr: kümeleme
uk: кластер
vi: cụm
zh_hans: 聚类
zh_hant: 群組

# agent.capability.compare
source: compare
ar: مقارنة
de: Vergleichen
es: comparar
fr: comparaison
id: bandingkan
it: confronta
ja: 比較
ko: 비교
nl: vergelijk
pl: porównanie
pt_br: comparar
ru: сравнение
tr: karşılaştırma
uk: порівняння
vi: so sánh
zh_hans: 对比
zh_hant: 比較

# agent.capability.confirm
source: confirm
ar: تأكيد
de: Bestätigen
es: confirmar
fr: confirmation
id: konfirmasi
it: conferma
ja: 確認
ko: 확인
nl: bevestig
pl: potwierdzenie
pt_br: confirmar
ru: подтверждение
tr: onaylama
uk: підтвердження
vi: xác nhận
zh_hans: 确认
zh_hant: 確認

# agent.capability.queue
source: queue
ar: صف
de: Warteschlange
es: cola
fr: file d'attente
id: antrian
it: coda
ja: キュー
ko: 큐
nl: wachtrij
pl: kolejka
pt_br: fila
ru: очередь
tr: kuyruk
uk: черга
vi: hàng đợi
zh_hans: 队列
zh_hant: 排隊

# agent.capability.release
source: release
ar: إصدار
de: Freigabe
es: liberación
id: rilisan
it: rilascio
ja: リリース
ko: 릴리스
pl: wydanie (release)
pt_br: lançamento
ru: выпуск
tr: serbest bırakma
uk: випуск
vi: phát hành
zh_hans: 发布
zh_hant: 釋出

# agent.capability.report
source: report
ar: قائمة
de: Bericht
es: informe
fr: rapport
id: laporan
ja: レポート
ko: 보고서
nl: rapport
pl: raport
pt_br: relatório
ru: отчёт
tr: rapor
uk: звіт
vi: báo cáo
zh_hans: 报告
zh_hant: 報告

# agent.capability.repository
source: repository
ar: مخزن
es: repositorio
fr: dépôt
ja: リポジトリ
ko: 리포지토리
pl: repozytorium
pt_br: repositório
ru: репозиторий
tr: depo
uk: репозиторій
vi: kho lưu trữ
zh_hans: 仓库
zh_hant: 倉庫

# agent.capability.review
source: review
ar: مراجعة
de: Überprüfung
es: revisión
fr: revue
it: recensione
ja: レビュー
ko: 검토
pl: recenzja
pt_br: revisão
ru: обзор
tr: inceleme
uk: огляд
vi: đánh giá
zh_hans: 复核
zh_hant: 審查

# agent.capability.semantic
source: semantic
ar: معنوي
de: Semantik
es: semántico
fr: sémantique
id: semantik
it: semantico
ja: 意味論的
ko: 의미론적
nl: semantisch
pl: semantyka
pt_br: semântico
ru: семантический
tr: semantik
uk: семантичний
vi: nghĩa học
zh_hans: 语义
zh_hant: 語義

# agent.capability.table
source: table
ar: جدول
de: Tabelle
es: tabla
fr: tableau
id: tabel
it: tabella
ja: テーブル
ko: 테이블
nl: tabel
pl: tabela
pt_br: tabela
ru: таблица
tr: tablo
uk: таблиця
vi: bảng
zh_hans: 表格
zh_hant: 表格

# agent.capability.taxonomy
source: taxonomy
ar: تصنيف
de: Taxonomie
es: taxonomía
fr: taxonomie
id: taksonomi
it: tassonomia
ja: 分類体系
ko: 분류학
nl: taxonomie
pl: taksonomia
pt_br: taxonomia
ru: таксономия
tr: taksonomi
uk: таксономія
vi: thuật ngữ học
zh_hans: 分类
zh_hant: 分類學

# agent.capability.trending
source: trending
ar: متداول
de: Trend
es: tendencia
fr: tendance
it: trend
ja: トレンド
ko: 트렌드
nl: trend
pl: trendy
pt_br: em alta
ru: трендовый
tr: trend
uk: трендовий
vi: xu hướng
zh_hans: 趋势
zh_hant: 熱門

# agent.capability.watch
source: watch
ar: متابعة
de: Beobachten
es: vigilancia
fr: surveillance
id: pantau
it: monitoraggio
ja: 監視
ko: 감시
nl: bewaak
pl: obserwacja
pt_br: monitorar
ru: мониторинг
tr: izleme
uk: моніторинг
vi: theo dõi
zh_hans: 关注
zh_hant: 監視

# agent.context.source.failure
source: Starcat local repository snapshot failed
ar: فشل نسخ مخزن Starcat المحلي
de: Starcat lokaler Repository-Snapshot fehlgeschlagen
es: Error en la captura local de Starcat: repositorio no disponible
fr: Échec de la capture instantanée du dépôt local Starcat
id: Snapshot repository lokal Starcat gagal
it: Snapshot locale di Starcat fallito
ja: Starcat ローカルリポジトリスナップショットに失敗しました
ko: Starcat 로컬 리포지토리 스냅샷 실패
nl: Lokaal Starcat repository-snapshot mislukt
pl: Błąd pobierania lokalnego snapshotu repozytorium Starcat
pt_br: Snapshot local do repositório Starcat falhou
ru: Снимок локального репозитория Starcat не удался
tr: Starcat yerel depoda snapshot başarısız oldu
uk: Спроба створення локального снимку репозиторію Starcat завершилася невдало
vi: Lỗi khi lấy snapshot kho lưu trữ Starcat địa phương
zh_hans: Starcat 本地仓库快照读取失败
zh_hant: Starcat 本地倉庫快照失敗

# agent.externalSearch.error.invalidArgumentFormat
source: external_search argument %@ has an invalid value.
ar: تنسيق قيمة `external_search` في `%@` غير صالح.
de: Der Parameter %@ von external_search hat einen ungültigen Wert.
es: El argumento %@ de external_search tiene un formato inválido.
fr: l'argument %@ de external_search contient une valeur invalide.
id: format argumen external_search %@ tidak valid.
it: Il formato dell'argomento %@ per *external_search* è invalido.
ja: external_search の引数 %@ は無効な値です。
ko: external_search 인수 %@의 값이 유효하지 않습니다.
nl: De argumenten van external_search voor %@ hebben een ongeldige waarde.
pl: Argument %@ dla external_search ma nieprawidłową wartość.
pt_br: O argumento `external_search` %@ possui valor inválido.
ru: Аргумент external_search %@ имеет некорректное значение.
tr: external_search argümanı %@ geçersiz bir değer içeriyor.
uk: Аргумент external_search %@ має недійсну форму.
vi: Định dạng tham số %@ của external_search không hợp lệ.
zh_hans: external_search 参数 %@ 的值无效。
zh_hant: external_search 的參數 %@ 值無效。

# agent.externalSearch.error.missingQuery
source: external_search requires a non-empty query.
ar: يحتاج `external_search` إلى استعلام غير فارغ.
de: external_search benötigt eine nicht-leere Abfrage.
es: external_search requiere una consulta no vacía.
fr: external_search nécessite une requête non vide.
id: external_search memerlukan query yang tidak kosong.
it: *external_search* richiede una query non vuota.
ja: external_search は空でないクエリが必要です。
ko: external_search는 비어있지 않은 쿼리가 필요합니다.
nl: external_search vereist een niet-leeg query-veld.
pl: external_search wymaga niepustego zapytania.
pt_br: O `external_search` requer uma consulta não vazia.
ru: external_search требует непустой запрос.
tr: external_search için boş olmayan bir sorgunun olması gerekmektedir.
uk: external_search вимагає непустий запит.
vi: external_search yêu cầu một truy vấn không rỗng.
zh_hans: external_search 需要非空 query。
zh_hant: external_search 需要一個非空的查詢。

# agent.json.error.invalidUTF8
source: Agent JSON contains invalid UTF-8 text.
ar: JSON الوكيل يحتوي على نص UTF-8 غير صالح.
de: Agent JSON enthält ungültigen UTF-8-Text.
es: El JSON del Agente contiene texto UTF-8 inválido.
fr: Le JSON de l'Agent contient du texte UTF-8 invalide.
id: JSON Agent mengandung teks UTF-8 tidak valid.
it: JSON dell'Agent contiene testo UTF-8 non valido.
ja: Agent JSON に無効な UTF-8 テキストがあります。
ko: Agent JSON에 무효한 UTF-8 텍스트가 포함되어 있습니다.
nl: Agent JSON bevat ongeldig UTF-8 tekst.
pl: JSON Agent zawiera niepoprawny tekst UTF-8.
pt_br: JSON do Agente contém texto UTF-8 inválido.
ru: JSON-агент содержит некорректный UTF-8 текст.
tr: Agent JSON dosyası geçersiz UTF-8 metin içeriyor.
uk: JSON-агент містить недійсний UTF-8 текст.
vi: Agent JSON chứa văn bản UTF-8 không hợp lệ.
zh_hans: Agent JSON 包含无效的 UTF-8 文本。
zh_hant: 代理人 JSON 包含無效 UTF-8 文字。

# agent.json.error.nonFiniteNumber
source: Agent JSON contains a non-finite number.
ar: JSON الوكيل يحتوي على عدد غير محدود.
de: Agent JSON enthält keine endliche Zahl.
es: El JSON del Agente contiene un número no finito.
fr: Le JSON de l'Agent contient un nombre non fini.
id: JSON Agent mengandung angka tak hingga.
it: Il JSON dell'Agent contiene un numero non finito.
ja: Agent JSON に有限ではない数値があります。
ko: Agent JSON에 유한하지 않은 숫자가 포함되어 있습니다.
nl: Agent JSON bevat een oneindige of niet-numerieke waarde.
pl: JSON Agent zawiera liczbę nieskończoną lub nieokreśloną.
pt_br: JSON do Agente contém número não finito.
ru: JSON-агент содержит неконечное число.
tr: Agent JSON dosyasında sonlu olmayan bir sayı bulunuyor.
uk: JSON-агент містить нескінченне число.
vi: Agent JSON chứa số vô hạn hoặc không xác định.
zh_hans: Agent JSON 包含非有限数值。
zh_hant: 代理人 JSON 包含非有限數字。

# agent.loop.error.approvalRejected
source: The user rejected this tool call.
ar: رفض المستخدم هذاrufدالة.
de: Der Benutzer hat diesen Tool-Aufruf abgelehnt.
es: El usuario rechazó esta llamada a la herramienta.
fr: L'utilisateur a rejeté cet appel d'outil.
id: Pengguna menolak panggilan alat ini.
it: L'utente ha rifiutato questa chiamata allo strumento.
ja: ユーザーがこのツール呼び出しを拒否しました。
ko: 사용자가 이 도구 호출을 거부했습니다.
nl: De gebruiker heeft deze tool-aanroep afgewezen.
pl: Użytkownik odrzucił ten wywołanie narzędzia.
pt_br: O usuário rejeitou esta chamada de ferramenta.
ru: Пользователь отклонил этот вызов инструмента.
tr: Kullanıcı bu araç çağrısını reddetti.
uk: Користувач відхилив цей виклик інструменту.
vi: Người dùng đã từ chối cuộc gọi công cụ này.
zh_hans: 用户已拒绝此工具调用。
zh_hant: 使用者拒絕此工具呼叫。

# agent.loop.error.approvalRequiredFormat
source: Tool %@ requires user approval before execution.
ar: يحتاج أداة `%@` إلى موافقة مستخدم قبل التنفيذ.
de: Das Tool %@ benötigt eine Benutzergenehmigung vor der Ausführung.
es: La herramienta %@ requiere aprobación del usuario antes de ejecutarse.
fr: L'outil %@ nécessite une approbation utilisateur avant exécution.
id: Alat %@ memerlukan persetujuan pengguna sebelum eksekusi.
it: Lo strumento %@ richiede l'approvazione utente prima dell'esecuzione.
ja: ツール %@ は実行前にユーザーの承認が必要です。
ko: 도구 %@는 실행 전에 사용자 승인이 필요합니다.
nl: Tool %@ vereist gebruikersgoedkeuring voordat deze wordt uitgevoerd.
pl: Narzędzie %@ wymaga zatwierdzenia użytkownika przed wykonaniem.
pt_br: A ferramenta %@ exige aprovação do usuário antes da execução.
ru: Инструмент %@ требует утверждения пользователя перед выполнением.
tr: Araç %@ kullanımı için kullanıcı onayı gerektiriyor.
uk: Інструмент %@ вимагає схвалення користувача перед виконанням.
vi: Công cụ %@ yêu cầu phê duyệt của người dùng trước khi thực thi.
zh_hans: 工具 %@ 必须由用户确认后才能执行。
zh_hant: 工具 %@ 執行前需要用戶批准。
